{"\f": ["MOLECULAR BIOLOGY 3M03 \n", "Winter 2021 \n", "Course Details \n", "LSB 429 \n", "Instructor: \n", "Undergraduate Coordinator: \n", "TBA \n", "LSB 119 \n", "mgeorg@mcmaster.ca \n", "jacobsr@mcmaster.ca \n", "Lab: \n", "Text:    \n", "Mon and Wed 10:30, Location To Be Determined \n", "Developmental Biology  - Barresi & Gilbert 11th or 12th  Edition \n", "Laboratory handouts will be available on Avenue to Learn. \n", "Course Description \n", "Advances in developmental biology using genetic and molecular approaches will be discussed in \n", "and related to human development. \n", "Two lectures, one tutorial or lab (three hours); one term \n", "Live lectures complemented with recorded lectures with closed captions. Tests scheduled during \n", "Outline: \n", "and molecular genetic perspectives. Lecture material will be complemented by \n", "The first part of the course will focus on early development in classical model systems (sea urchin \n", "discussing both classical and contemporary experiments. The second part of the course will \n", "and human development. The third and final part of the course will focus on current research \n", "topics and trends, such a role of environment in shaping developmental processes, and how \n", "laboratory modules will employ model organisms: C. elegans, Sea Urchin, Chick embryo, Zebrafish \n", "the maturing embryo and the adult form. \n", "Course Objectives \n", "By the end of this course students will be able to: \n", "• \n"], "\n": ["Animal Physiology: Homeostasis \n", "Course Details \n", "Office hours: Friday 4:30pm-6:30 pm (LSB 530 or via Microsoft Teams) \n", "Course Coordinator: Dr. Mihaela Georgescu (LSB 119A; mgeorg@mcmaster.ca) \n", "Lab/TA’s: TBA \n", "Lectures: Mondays and Wednesdays 11:30 am - 12:20 pm, Location To Be Determined \n", "Laboratories: Tues, Wed, Thu 8:30 - 11:20 am and 2:30 - 5:20 pm in LSB 109 (Lab manual will be available via \n", "Students may make their own section switches via MOSAIC.  Students who miss a lab may not attend another lab \n", "or a grade of zero will be recorded. \n", "both BIOLOGY 1A03 and registration in Level III or above of Honours Kinesiology. BIOCHEM \n", "(B.H.Sc.), Bachelor of Health Sciences (Honours) - Biomedical Sciences Specialization \n", "Bachelor of Health Sciences (Honours) - Global Health Specialization (B.H.Sc.), or with credit or \n", "of fluid and electrolyte balance, kidney function, the principles of acid-base homeostasis, and \n", "and some laboratory exercises will employ non-mammalian vertebrates so as to provide a \n", "IMPORTANT NOTE: This course involves mandatory laboratory exercises involving the use of \n", "exercises involve experiments on the human body (your own).  IF YOU HAVE OBJECTIONS TO \n", "Week(s)Lecture Topic: 1.Circulation & Pressure-Flow Relationships, 2.Compliance, Distensibility, & \n", "Mechanisms, 7. Acid-base regulation, 8.Respiration  & Pulmonary Ventilation, 9.Control of Ventilation. \n", "Week \n", "Lectures \n", "Laboratory/Seminar \n", "     NO LABS \n", "2. Exercise, Heart Rate, ECG and Peripheral Blood Flow  \n", "Seminars \n", "3. Autonomic Control of Frog Heart     \n", "1 \n", "3 \n", "4 \n", "6 \n", "7 \n", "8 \n"]}